<?php
header("Content-Type: text/html;charset=utf-8");
?>
<meta http-equiv="Content-Type" content="text/html;charser=utf-8"/>
<?php
//основные операторы
//операторы присваения "="
//$firstName = "имя";
//$lastName = "фамилия";
//$fullName = $firstName . $lastName; //оператор конкатенации
//$fullName = $lasrtName . " - " . $lastName; //изменели выводы.
//echo $fullName;
//условные операторы
//if
echo "</br>=================================================================</br>";
$a = 7;
$b = 6;
if ($a == $b){
    echo ' А равно В';
}
echo "</br>=================================================================</br>";
if ($a == $b) {
    echo 'А равно В';
} else {
    echo 'А не равно В'; 
}
// опратор elseif

echo "</br>=================================================================</br>";
$c = 10;
$d = 5;
if ($a == $b) {
 echo 'А равно В';      
} elseif ($a == $c) {
    echo 'А равно C';
}elseif ($a == $d) {
    echo 'А равно D';
} else {
    echo 'А ничему не равно';
}
echo "</br>=================================================================</br>";
switch ($a) {
    case $a:
echo 'А равно В';
        break;
        case $c:
echo 'А равно C';            
        case $d:
        echo 'А равно D';
    break;
    default:  
        echo 'А ничему не равно';
     break;
}
echo "</br>=================================================================</br>";
for ($i = 1; $i<101; $i = $i + 1) {
    echo $i . '<br>';
}
echo "</br>=================================================================</br>";
$i = 1;
while ($i<101) {
    echo $i . '<br>';
    $i = $i + 1;
}
echo "</br>=================================================================</br>";
$myArray = array('Привет ', 'Мир ', 'родился ','новый ','программист');
foreach ($myArray as $value) {
  echo $value;  
}
echo "</br>=================================================================</br>";